modm-ext/data.modm.io/docs/svd/header_stm32g471xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VREFBUF</name>
      <description>VREFBUF</description>
      <groupName>VREFBUF</groupName>
      <baseAddress>0x40010030</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>VREFBUF control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENVR</name>
              <description>Voltage reference buffer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIZ</name>
              <description>High impedance mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VRR</name>
              <description>Voltage reference buffer ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VRS</name>
              <description>VRS[5:0] bits (Voltage reference scale)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE0</name>
                  <description>Voltage reference scale 0 (VREFBUF_OUT = 2.048V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE1</name>
                  <description>Voltage reference scale 1 (VREFBUF_OUT = 2.5V)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE2</name>
                  <description>Voltage reference scale 2 (VREFBUF_OUT = 2.9V)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>VREFBUF calibration and control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIM</name>
              <description>TRIM[5:0] bits (Trimming code)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010200</baseAddress>
      <interrupt>
        <name>COMP1_2_3</name>
        <description>COMP1, COMP2 and COMP3 Interrupts</description>
        <value>64</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Comparator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator input minus selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator input plus selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input plus connected to IO1 (pin PA1 for COMP1, pin PA7 for COMP2, pin PA0 for COMP3, pin PB0 for COMP4, pin PB13 for COMP5, pin PB11 for COMP6, pin PB14 for COMP7). Note: For COMPx instance availability, please refer to datasheet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input plus connected to IO2 (pin PB1 for COMP1, pin PA3 for COMP2, pin PC1 for COMP3, pin PE7 for COMP4, pin PD12 for COMP5, pin PD11 for COMP6, pin PD14 for COMP7). Note: For COMPx instance availability, please refer to datasheet</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <description>COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTERESIS_10MV</name>
                  <description>Hysteresis level 10mV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTERESIS_20MV</name>
                  <description>Hysteresis level 20mV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTERESIS_30MV</name>
                  <description>Hysteresis level 30mV</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTERESIS_40MV</name>
                  <description>Hysteresis level 40mV</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTERESIS_50MV</name>
                  <description>Hysteresis level 50mV</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTERESIS_60MV</name>
                  <description>Hysteresis level 60mV</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTERESIS_70MV</name>
                  <description>Hysteresis level 70mV</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKING</name>
              <description>Comparator blanking source</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5_COMP1</name>
                  <description>Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP1). Note: For COMPx instance availability, please refer to datasheet</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5_COMP4</name>
                  <description>Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP4). Note: For COMPx instance availability, please refer to datasheet</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3_COMP1</name>
                  <description>Comparator output blanking source TIM2 OC3 (specific to COMP instance: COMP1). Note: For COMPx instance availability, please refer to datasheet</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC4_COMP3</name>
                  <description>Comparator output blanking source TIM2 OC4 (specific to COMP instance: COMP3). Note: For COMPx instance availability, please refer to datasheet</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM20_OC5</name>
                  <description>Comparator output blanking source TIM20 OC5 (Common to all COMP instances). Note: For TIM20 instance availability, please refer to datasheet</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_OC1</name>
                  <description>Comparator output blanking source TIM15 OC1 (Common to all COMP instances).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM4_OC3</name>
                  <description>Comparator output blanking source TIM4 OC3 (Common to all COMP instances).</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRGEN</name>
              <description>Comparator scaler bridge enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCALEN</name>
              <description>Comparator voltage scaler enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VALUE</name>
              <description>Comparator output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCK</name>
              <description>Comparator lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
